src/cf/DataProcessors/РаботаСРезультатамиОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>РаботаСРезультатамиОбмена</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/ОбъектыКЗагрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОбъектыКЗагрузке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаДобавления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныДобавленияВРегистрОбъектыКЗагрузке</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КомментарийАдминистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановкиПричиныДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеПредставлениеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставлениеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбрабатываемойВерсии</Name>
					<Comment>Соответствует дате добавления в РС "Прочитанные данные сообщений обмена". Если отличается, то были прочитаны новые данные</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеСконвертированногоОбъекта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбновленияОбъектаВИБ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбновленияОбъектаПриПроблемахЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяСсылкаНаОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбрабатывающегоЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъектаФорматаЗапросаНаВыгрузку</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПространствоИменОбъектаФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправкиЗапросаНаВыгрузку</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПолученныйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПравилоКонвертации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ПричиныДобавленияВРегистрОбъектыКЗагрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПричиныДобавленияВРегистрОбъектыКЗагрузке</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОжидаетЗагрузкуДругихОбъектов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяПолучениеЭтогоОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПоискСоответствия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПодтверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаКонвертации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПроведения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПроверкиПриЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданоНаКонвертацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовоКЗагрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаОтклонена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СтатусыОбновленияОбъектаПриПроблемахЗаписи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыОбновленияОбъектаПриПроблемахЗаписи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗагруженСозданНовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗагруженНеСоздан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженОбновлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗагруженНеОбновлен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DataProcessors/РаботаСРезультатамиОбмена/Forms/ЗагруженныеОбъектыСПроблемамиПриЗаписи/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	ОбработатьПереданныеПараметры();
	
	ЗаполнитьСписокВыбораОбъектыМетаданных();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСРезультатамиОбмена.ОбработатьСохраненныеНастройкиОтбораОбъектыМетаданныхПередЗагрузкой(
		Настройки, ДоступныеДляОтбораТипыОбъектов, ОбъектыМетаданныхОтбор, Список);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	НастройкиПроблемаОтбор = Настройки.Получить("ПроблемаОтбор");
	
	Если НастройкиПроблемаОтбор <> Неопределено Тогда
		
		РаботаСРезультатамиОбмена.ИзменитьОтборСтатусЗагрузкиПроблемаНаСервере(Список, НастройкиПроблемаОтбор);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ПричинаДобавленияОбъектыКЗагрузке" Тогда
		
		Элементы.Список.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПолученияНавигационнойСсылки(Ключ, Представление, НавигационнаяСсылка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НавигационнаяСсылка = НавигационнаяСсылкаФормы;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#Область ТипыОбъектов

&НаКлиенте
Процедура ОбъектыМетаданныхОтборПриИзменении(Элемент)
	
	УстановитьОтборТипМетаданных();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыМетаданныхОтборНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	РаботаСРезультатамиОбменаКлиент.МножественныйОтборСпискаНачалоВыбора(ЭтотОбъект,
	                                                                     Элемент,
	                                                                     ОбъектыМетаданныхОтбор,
	                                                                     Неопределено,
	                                                                     НСтр("ru = 'Выбранные типы объектов'"),
	                                                                     ДоступныеДляОтбораТипыОбъектов);
	
КонецПроцедуры

#КонецОбласти

#Область ТипыПроблем

&НаКлиенте
Процедура ПроблемаОтборНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("УстановленныеОтборы",    ПроблемаОтбор);
	ПараметрыОткрытия.Вставить("ДляЗагруженныхОбъектов", Истина);
	
	ОповещениеОИзмененииОтбораСтатусЗагрузки = Новый ОписаниеОповещения("ПослеИзмененияОтборСтатусЗагрузки", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.РаботаСРезультатамиОбмена.Форма.ОтборСтатусовПроблемыПриЗаписи", ПараметрыОткрытия, ЭтотОбъект,,,,
	            ОповещениеОИзмененииОтбораСтатусЗагрузки,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроблемаОтборОчистка(Элемент, СтандартнаяОбработка)
	
	Если ПроблемаОтбор.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПроблемаОтбор.Очистить();
	ИзменитьОтборСтатусЗагрузкиНаСервере();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	РаботаСРезультатамиОбмена.ПолучитьПредставленияОбъектовПриПолученииДанныхНаСервереСписка(ИмяЭлемента, Настройки, Строки);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "СписокПредставлениеОбъекта" Тогда
		
		Если ЗначениеЗаполнено(ТекущиеДанные.ВнешняяСсылкаНаОбъект) Тогда
			ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(ТекущиеДанные.ВнешняяСсылкаНаОбъект);
		Иначе
			ОткрытьФормуПроблемы(ТекущиеДанные);
		КонецЕсли;
		
	ИначеЕсли Поле.Имя = "СписокСоответствиеВИБ" Тогда
		
		Если ЗначениеЗаполнено(ТекущиеДанные.СоответствиеВИБ) Тогда
			ПоказатьЗначение(, ТекущиеДанные.СоответствиеВИБ);
		Иначе
			ОткрытьФормуПроблемы(ТекущиеДанные);
		КонецЕсли;
		
	Иначе
		
		ОткрытьФормуПроблемы(ТекущиеДанные);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьИнтервал(Команда)
	
	Оповещение = Новый ОписаниеОповещения("УстановитьИнтервалЗавершение", ЭтотОбъект);
	
	РаботаСРезультатамиОбменаКлиент.РедактироватьПериод(Период, , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбъектВИсточнике(Команда)
	
	РаботаСРезультатамиОбменаКлиент.ПерейтиПоВнешнейСсылкеНаОбъектИзФормыСписка(ЭтотОбъект, "Список");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбъект(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если ТекущиеДанные = Неопределено
		Или ТипЗнч(ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка")
		Или Не ЗначениеЗаполнено(ТекущиеДанные.СоответствиеВИБ)Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Невозможно выполнить команду для указанного объекта'"));
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, ТекущиеДанные.СоответствиеВИБ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПроблему(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Команда не может быть выполнена для указанного объекта'"));
		Возврат;
		
	КонецЕсли;
	
	ОткрытьФормуПроблемы(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

#Область ИнициализацияФормы

&НаСервере
Процедура ОбработатьПереданныеПараметры()
	
	УзелИнформационнойБазы = Параметры.УзелИнформационнойБазы;
		
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "УзелПланаОбмена", УзелИнформационнойБазы, Истина);
	НавигационнаяСсылкаФормы = РаботаСРезультатамиОбмена.НавигационнаяСсылкаФормыСписка(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораОбъектыМетаданных()
	
	ТипыПричин = Новый Массив;
	ТипыПричин.Добавить(Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаЗаписи);
	ТипыПричин.Добавить(Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроверкиПриЗаписи);
	ТипыПричин.Добавить(Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроведения);
	
	ДоступныеДляОтбораТипыОбъектов = РегистрыСведений.ОбъектыКЗагрузке.ТипыОбъектовМетаданныхСПроблемами(
		УзелИнформационнойБазы, ТипыПричин, ДополнительноеУсловиеОтбораПроблем());
	
КонецПроцедуры

&НаСервере
Функция ДополнительноеУсловиеОтбораПроблем()

	Возврат "И (ОбъектыКЗагрузке.СтатусОбновленияОбъектаВИБ = ЗНАЧЕНИЕ(Перечисление.СтатусыОбновленияОбъектаПриПроблемахЗаписи.ЗагруженСозданНовый)
	|	ИЛИ ОбъектыКЗагрузке.СтатусОбновленияОбъектаВИБ = ЗНАЧЕНИЕ(Перечисление.СтатусыОбновленияОбъектаПриПроблемахЗаписи.ЗагруженОбновлен))"

КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	СписокУсловноеОформление = Список.КомпоновщикНастроек.Настройки.УсловноеОформление;
	СписокУсловноеОформление.Элементы.Очистить();
	
	РаботаСРезультатамиОбмена.УстановитьУсловноеОформлениеИдентификаторПолученногоОбъекта(СписокУсловноеОформление, "ПредставлениеОбъекта");
	
КонецПроцедуры

#КонецОбласти

#Область ИзменениеОтборов

&НаКлиенте
Процедура ФормаМножественногоОтбораПослеЗакрытия(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДополнительныеПараметры.Свойство("Элемент") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ДополнительныеПараметры.Элемент = Элементы.ОбъектыМетаданныхОтбор Тогда
		
		ОбъектыМетаданныхОтбор = Результат;
		УстановитьОтборТипМетаданных();
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьОтборТипМетаданных()
	
	РаботаСРезультатамиОбмена.УстановитьОтборТипМетаданныхВСписке(Список, ОбъектыМетаданныхОтбор);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервалЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт

	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Период = ВыбранноеЗначение;
	УстановитьОтборПоПериоду();

КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоПериоду()
	
	Список.Параметры.УстановитьЗначениеПараметра("НачалоПериода",
		Период.ДатаНачала);
	Список.Параметры.УстановитьЗначениеПараметра("КонецПериода", 
		?(ЗначениеЗаполнено(Период.ДатаОкончания), Период.ДатаОкончания, КонецДня(Дата(3999, 12, 31)))); 
		
	Элементы.ДекорацияОтборПериод.Заголовок = ПредставлениеПериода(Период.ДатаНачала, Период.ДатаОкончания,);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеИзмененияОтборСтатусЗагрузки(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПроблемаОтбор = Результат;
	
	ИзменитьОтборСтатусЗагрузкиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьОтборСтатусЗагрузкиНаСервере()
	
	РаботаСРезультатамиОбмена.ИзменитьОтборСтатусЗагрузкиПроблемаНаСервере(Список, ПроблемаОтбор);
	
КонецПроцедуры

#КонецОбласти

#Область ФормаПроблемы

&НаКлиенте
Процедура ОткрытьФормуПроблемы(ТекущиеДанные)
	
	ДанныеЗаписи = РаботаСРезультатамиОбменаКлиентСервер.НовыйКлючЗаписиОбъектыКЗагрузке();
	
	ДанныеЗаписи.ПолученныйОбъект   = ТекущиеДанные.ПолученныйОбъект;
	ДанныеЗаписи.ПравилоКонвертации = ТекущиеДанные.ПравилоКонвертации;
	ДанныеЗаписи.ОбъектФормата      = ТекущиеДанные.ОбъектФормата;
	ДанныеЗаписи.УзелПланаОбмена    = УзелИнформационнойБазы;
	
	ОповещениеОЗакрытииФормыПроблемы = Новый ОписаниеОповещения("ПослеЗакрытияФормыПроблемы", ЭтотОбъект);
	
	РаботаСРезультатамиОбменаКлиент.ОткрытьФормуПроблемы(
		ДанныеЗаписи, ЭтотОбъект, 
		ТекущиеДанные.СтатусЗагрузки, ОповещениеОЗакрытииФормыПроблемы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыПроблемы(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Результат.ТребуетсяВыборНовойПроблемы Тогда
		
		РаботаСРезультатамиОбменаКлиент.ОткрытьФормуВыбораПроблемыПоРезультатамЗагрузки(ЭтотОбъект, Результат);
	
	ИначеЕсли Результат.ОткрытьОбъектИБПослеОбработки
		И ЗначениеЗаполнено(Результат.ОбъектИБ) Тогда
		
		ПоказатьЗначение(, Результат.ОбъектИБ);
		
	ИначеЕсли Результат.ПереоткрытьФормуПроблему Тогда
		
		РаботаСРезультатамиОбменаКлиент.ПереоткрытьФормуПроблемыПослеОтработки(ЭтотОбъект, Результат);
		
	ИначеЕсли Результат.ТребуетсяЗакрытиеИВыводПредупреждения Тогда
		
		ПоказатьПредупреждение(,Результат.ТекстПредупреждения);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти



#КонецОбласти
